In [49]:
import pandas as pd
#pd.read_excel?
brics = pd.read_csv("brics.csv")
brics

  Unnamed: 0       country    capital    area  population
0         BR        Brazil   Brasilia   8.516      200.40
1         RU        Russia     Moscow  17.100      143.50
2         IN         India  New Delhi   3.286     1252.00
3         CH         China    Beijing   9.597     1357.00
4         SA  South Africa   Pretoria   1.221       52.98

In [50]:
brics = pd.read_csv("brics.csv", index_col =0)

In [51]:
brics

         country    capital    area  population
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Delhi   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

In [52]:
brics.describe()

            area   population
count   5.000000     5.000000
mean    7.944000   601.176000
std     6.200557   645.261454
min     1.221000    52.980000
25%     3.286000   143.500000
50%     8.516000   200.400000
75%     9.597000  1252.000000
max    17.100000  1357.000000

In [53]:
brics["country"]

BR          Brazil
RU          Russia
IN           India
CH           China
SA    South Africa
Name: country, dtype: object

In [54]:
brics.country

BR          Brazil
RU          Russia
IN           India
CH           China
SA    South Africa
Name: country, dtype: object

In [55]:
for i in range(len(brics["country"])):
    brics["on_earth"]="True"
 
  
brics

         country    capital    area  population on_earth
BR        Brazil   Brasilia   8.516      200.40     True
RU        Russia     Moscow  17.100      143.50     True
IN         India  New Delhi   3.286     1252.00     True
CH         China    Beijing   9.597     1357.00     True
SA  South Africa   Pretoria   1.221       52.98     True

In [56]:
brics["on_earth1"]="False"

In [57]:
brics

         country    capital    area  population on_earth on_earth1
BR        Brazil   Brasilia   8.516      200.40     True     False
RU        Russia     Moscow  17.100      143.50     True     False
IN         India  New Delhi   3.286     1252.00     True     False
CH         China    Beijing   9.597     1357.00     True     False
SA  South Africa   Pretoria   1.221       52.98     True     False

In [58]:
brics

         country    capital    area  population on_earth on_earth1
BR        Brazil   Brasilia   8.516      200.40     True     False
RU        Russia     Moscow  17.100      143.50     True     False
IN         India  New Delhi   3.286     1252.00     True     False
CH         China    Beijing   9.597     1357.00     True     False
SA  South Africa   Pretoria   1.221       52.98     True     False

In [59]:
brics["density"] = pd.Series(brics["population"] / brics["area"] * 1000000).round(0)

brics

,country,capital,area,population,on_earth,on_earth1,density
BR,Brazil,Brasilia,8.516,200.40,True,False,23532175.0
RU,Russia,Moscow,17.100,143.50,True,False,8391813.0
IN,India,New Delhi,3.286,1252.00,True,False,381010347.0
CH,China,Beijing,9.597,1357.00,True,False,141398354.0
SA,South Africa,Pretoria,1.221,52.98,True,False,43390663.0

In [60]:
brics.to_excel("brics_1.xlsx")

In [61]:
type(brics["density"])

pandas.core.series.Series

In [62]:
s = pd.Series(brics["density"],dtype='int32')
print(s)

BR     23532175
RU      8391813
IN    381010347
CH    141398354
SA     43390663
Name: density, dtype: int32

In [63]:
brics.loc["BR"]

country           Brazil
capital         Brasilia
area               8.516
population         200.4
on_earth            True
on_earth1          False
density       23532175.0
Name: BR, dtype: object

In [64]:
brics.iloc[1:3]

   country    capital    area  population on_earth on_earth1      density
RU  Russia     Moscow  17.100       143.5     True     False    8391813.0
IN   India  New Delhi   3.286      1252.0     True     False  381010347.0

In [65]:
brics.iloc[1:3,2:4]

      area  population
RU  17.100       143.5
IN   3.286      1252.0

In [66]:
brics["capital"].loc["CH"]

'Beijing'

In [67]:
brics.loc["CH"]["capital"]

'Beijing'

In [68]:
brics.iloc[0,2:4]

area          8.516
population    200.4
Name: BR, dtype: object

In [69]:
#del brics["country"]
brics

,country,capital,area,population,on_earth,on_earth1,density
BR,Brazil,Brasilia,8.516,200.40,True,False,23532175.0
RU,Russia,Moscow,17.100,143.50,True,False,8391813.0
IN,India,New Delhi,3.286,1252.00,True,False,381010347.0
CH,China,Beijing,9.597,1357.00,True,False,141398354.0
SA,South Africa,Pretoria,1.221,52.98,True,False,43390663.0